{
  "features": [
    {
      "type": "Feature",
      "properties": {
        "cafe_id": 1,
        "name": "Torridon Youth Hostel",
        "address": "Torridon, by Achnasheen, Ross-shire",
        "desc": "Winner of the Silver Award in the The Great Outdoors Magazine Awards 2020 for accommodation, Torridon Youth Hostel sits on the NC500 at the head of Upper Loch Torridon and is a popular base for hillwalkers, climbers and those simply wishing to relax and enjoy the surroundings and local wildlife."
      },
      "geometry": {
        "type": "Point",
        "coordinates": [57.543799, -5.504566]
      }
    },
    {
      "type": "Feature",
      "properties": {
        "cafe_id": 2,
        "name": "Inverness Youth Hostel",
        "address": "Victoria Drive, Inverness",
        "desc": "Located in a quiet neighbourhood a short walk from the city centre, Inverness Youth Hostel offers guests four star VisitScotland accredited hostel accommodation. A popular choice for individual travellers, backpackers, families and groups, the hostel has a range of private and en-suite rooms as well as spacious shared accommodation with individual lockers for those exploring the ‘Capital of the Highlands’ on a budget. Some of the rooms enjoy glorious views towards the Moray Firth."
      },
      "geometry": {
        "type": "Point",
        "coordinates": [57.480662, -4.211335]
      }
    },
    {
      "type": "Feature",
      "properties": {
        "cafe_id": 3,
        "name": "Gairloch Sands Youth Hostel",
        "address": "Carn Dearg, Gairloch, Ross-shire",
        "desc": "A lochside lodge, sitting on the northern shore of Loch Gairloch, with magnificent sea and mountain views and easy access to fantastic sandy beaches. Gairloch Sands Youth Hostel is a great base for exploring the North West Highlands, offering guests a range of comfortable private and shared rooms. None of the rooms are en-suite but ample shower and washroom facilities are available."
      },
      "geometry": {
        "type": "Point",
        "coordinates": [57.732262, -5.759794]
      }
    },
    {
      "type": "Feature",
      "properties": {
        "cafe_id": 4,
        "name": "Tongue Hostel",
        "address": "Tongue, By Lairg, Sutherland",
        "desc": "Tongue Hostel is a magnificently situated stone lodge on the shores of the Kyle of Tongue. Once a former hunting and fishing lodge dating back to 1891, the hostel offers wonderful views of Ben Loyal, Ben Hope and Rabbit Island. A short walk from Tongue village, it's a perfect place for hill walking, cycling, fishing, photography, nature and bird watching with plenty of beaches to explore."
      },
      "geometry": {
        "type": "Point",
        "coordinates": [58.492768, -4.42843]
      }
    },
    {
      "type": "Feature",
      "properties": {
        "cafe_id": 5,
        "name": "Ullapool Youth Hostel",
        "address": "Shore Street, Ullapool",
        "desc": "From its spectacular seafront location on the NC500, Ullapool Youth Hostel offers wonderful, ever-changing views over Loch Broom and the Beinn Dearg mountain range. Perfect for groups, families and individual travellers, this warm and welcoming hostel offers guests a variety of room types, all of which can be booked as private rooms and there are ample shower and washroom facilities."
      },
      "geometry": {
        "type": "Point",
        "coordinates": [57.896333, -5.156314]
      }
    },
    {
      "type": "Feature",
      "properties": {
        "cafe_id": 6,
        "name": "Durness Smoo Youth Hostel",
        "address": "Smoo, Lairg",
        "desc": "Sitting on the famous NC500, surrounded by a wild and spectacular landscape, Durness Smoo offers a true hostelling experience in simple, relaxed and welcoming accommodation. A refuge from the hustle and bustle of everyday life, the hostel is an ideal base for exploring the local area, and offers guests a range of comfortable private and shared rooms. None of the rooms are en-suite but ample shower and washroom facilities are available."
      },
      "geometry": {
        "type": "Point",
        "coordinates": [58.563542, -4.723322]
      }
    },
    {
      "type": "Feature",
      "properties": {
        "id": 7,
        "name": "Helmsdale Hostel",
        "address": "Helmsdale, Sutherland",
        "desc": "Helmsdale Hostel is an International Tourist Accommodation, located in the village of Helmsdale, Sutherland. It is in a prominent position directly on the A9 at the north end of the village. The building was refurbished in the summer of 2018, with eco-friendly measures, including a sustainable heating system, drying and laundry facilities."
      },
      "geometry": {
        "type": "Point",
        "coordinates": [58.117588, -3.648901]
      }
    },
    {
      "type": "Feature",
      "properties": {
        "id": 8,
        "name": "Applecross, Hartfield House",
        "address": "Hartfield House, Applecross",
        "desc": "Hartfield House is a Visit Scotland 4 Star hostel, set back from main North Coast 500 road, nestled amongst the mountainous landscape, shady trees, and bubbling river. The Applecross peninsula boasts a breathtakingly beautiful and dramatic landscape. The main township of Applecross (‘a Chomraich’ in Gaelic, which means 'sanctuary') is located around the picturesque bay and enjoys uninterrupted views over the island of Raasay and the Cuillin Hills of Skye."
      },
      "geometry": {
        "type": "Point",
        "coordinates": [57.452662, -5.802272]
      }
    },

    {
      "type": "Feature",
      "properties": {
        "id": 9,
        "name": "Achmelvich Beach Youth Hostel",
        "address": "Recharn, Lairg, Sutherland",
        "desc": "Winning silver in the The Great Outdoors Magazine awards for accommodation - Achmelvich Beach Youth Hostel sits on the NC500, beside a beautiful, sheltered white sandy beach, close to the iconic mountain of Suilven. This small and friendly hostel provides a relaxing base to explore miles of unspoilt coastline and discover quiet secluded beaches, crystal clear waters and abundant wildlife."
      },
      "geometry": {
        "type": "Point",
        "coordinates": [58.168936, -5.304672]
      }
    },
    {
      "type": "Feature",
      "properties": {
        "id": 10,
        "name": "Portsoy",
        "address": "Back Green, Portsoy, Aberdeenshire",
        "desc": "The Sail Loft in Portsoy offers self-catering bunkhouse accommodation with 25 luxurious beds and bunks, all with premium quality mattresses, reading lights, power sockets and secure lockers. Beds are designed to be both singles or doubles, so can easily be adjusted to meet your needs. Cots are available for visiting families."
      },
      "geometry": {
        "type": "Point",
        "coordinates": [57.682264, -2.683269]
      }
    },
    {
      "type": "Feature",
      "properties": {
        "id": 11,
        "name": "Drumnadrochit",
        "address": "Loch Ness Backpackers, Coiltie Farmhouse",
        "desc": "Situated in the village of Lewiston within Drumnadrochit, a short distance from Loch Ness and Urquhart Castle, this is a perfect location for activity or relaxation and great for families, groups and individuals. It's an ideal location for the Great Glen Way. Loch Ness Backpackers is your Highland home away from home. The team provide a warm welcome in all weathers, with free tea and coffee, a wood stove, a large guest kitchen and a residents-only bar with over 100 Scottish beers and whiskies."
      },
      "geometry": {
        "type": "Point",
        "coordinates": [57.329341, -4.471393]
      }
    },
    {
      "type": "Feature",
      "properties": {
        "id": 12,
        "name": "Glen Affric Youth Hostel",
        "address": "Allt Beithe, Glen Affric, Cannich, Beauly",
        "desc": "A former stalking bothy on the Affric Estate, this friendly eco-hostel offers a warm welcome and an unforgettable experience in one of the most beautiful glens in Scotland. A wind turbine and solar panels provide warm water and electricity, while the comfortable common room and kitchen are heated by wood and coal fires."
      },
      "geometry": {
        "type": "Point",
        "coordinates": [57.23236, -5.1831]
      }
    },
    {
      "type": "Feature",
      "properties": {
        "id": 13,
        "name": "Ratagan Youth Hostel",
        "address": "Glenshiel, Kyle, Ross-shire",
        "desc": "Small and intimate, Ratagan Youth Hostel is has a stunning lochside location with enviable views towards Skye. Perfect for groups, families and individual travellers, this warm and welcoming hostel offers guests a variety of room types, all with USB charging points, and all able to be booked as private rooms. The accommodation is split over two floors and none of the rooms are en-suite, but ample shower and washroom facilities are available."
      },
      "geometry": {
        "type": "Point",
        "coordinates": [57.222139, -5.447147]
      }
    },
    {
      "type": "Feature",
      "properties": {
        "id": 14,
        "name": "Portree Youth Hostel",
        "address": "Portree, Isle of Skye",
        "desc": "Located in the heart of Portree, capital of the Isle of Skye, and one of Scotland’s most popular destinations, Portree Youth Hostel offers a range of room types, from small private en-suites to shared accommodation, some with views over the Sound of Rassay. All rooms have USB charging points and most have individual bed lights."
      },
      "geometry": {
        "type": "Point",
        "coordinates": [57.4122671, -6.1960968]
      }
    },
    {
      "type": "Feature",
      "properties": {
        "id": 15,
        "name": "Fort Augustus",
        "address": "Morag's Lodge, Bunoich Brae, Fort Augustus",
        "desc": "A multi-award winning hostel that delivers “Highland Hospitality” at its best. Located in the charming village of Fort Augustus, Morag's Lodge is an ideal base for exploring Loch Ness and the Great Glen. It's perfect for families and groups with great facilities including twin, double and ensuite rooms, a lively bar with open fire and regular live music."
      },
      "geometry": {
        "type": "Point",
        "coordinates": [57.148251, -4.682]
      }
    }
  ]
}
